exercises/vortexMerge_vortiFoam/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2212                                  |
  |   \\  /    A nd           | Website:  www.openfoam.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
	    version     2.0;
		format      ascii;
		arch        "LSB;label=32;scalar=64";
		class       dictionary;
		location    "system";
		object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
 	omega
	{
		field omega;
		domensions [0 0 -1 0 0 0 0 ];
		
		expression
        #{
           exp(-3.14*(sqr(pos().x() - 2.355) + sqr(pos().y() - 3.14))) + exp(-3.14*(sqr(pos().x() - 3.925) + sqr(pos().y() - 3.14)))
        #};
	}
);
